brew "chezmoi"

brew "starship"
brew "thefuck"
cask "font-fira-code-nerd-font"

# Kubernetes Stuff
brew "kubernetes-cli"
brew "krew"
brew "argocd"
brew "k9s"
brew "kind"
brew "cloud-provider-kind"
brew "tilt"
brew "ctlptl"
brew "helm"

# Python things and stuff
brew "uv"
brew "pipx"

# General Stuff
brew "npm"
cask "claude-code"

cask "flameshot" if OS.mac?

cask "visual-studio-code" if OS.mac?
cask "google-chrome" if OS.mac?
