tap "discoteq/discoteq"
tap "homebrew/cask-fonts"
tap "kubero-dev/kubero"
tap "osrf/simulation"
tap "passbolt/tap"
tap "px4/px4"
tap "romkatv/powerlevel10k"
tap "siderolabs/tap"
tap "supabase/tap"
tap "tinygo-org/tools"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# TIFF library and utilities
brew "libtiff"
# Flexible lightweight test report tool
brew "allure"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Java build tool
brew "ant"
# New file format for still image compression
brew "jpeg-xl"
# Cross-platform C++ Library for asynchronous programming
brew "asio"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Physics SDK
brew "bullet"
# Translates human-readable Butane Configs into machine-readable Ignition Configs
brew "butane"
# Object-file caching compiler wrapper
brew "ccache"
# C++ template library for linear algebra
brew "eigen"
# GNU multiple precision arithmetic library
brew "gmp"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# File format designed to store large amounts of data
brew "hdf5"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Robot Operating System-independent package for logging
brew "console_bridge"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl compatible regular expressions library
brew "pcre"
# Improved tinyxml (in memory efficiency and size)
brew "tinyxml2"
# Static analysis of C and C++ code
brew "cppcheck"
# Lightweight unit testing framework for C
brew "cunit"
# Fast Library for Approximate Nearest Neighbors
brew "flann"
# Interior point optimizer
brew "ipopt"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Super fast C++ logging library
brew "spdlog"
# Dynamic Animation and Robotics Toolkit
brew "dartsim"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Manage large fleets of Kubernetes clusters
brew "fleet-cli"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# HTTP client/server library for GNOME
brew "libsoup"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Implementation of the Secure Real-time Transport Protocol
brew "srtp"
# Development framework for multimedia applications
brew "gstreamer"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Fast and secure open-source backup
brew "kopia"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# LaTeX to XML/HTML/MathML Converter
brew "latexml"
# Postgres C API library
brew "libpq"
# General purpose TCP-IP emulator
brew "libslirp"
# Music engraving system
brew "lilypond"
# OpenAI alternative
brew "localai"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Package for scientific computing with Python
brew "numpy"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Cross-platform application and UI framework
brew "qt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Orocos Kinematics and Dynamics C++ library
brew "orocos-kdl"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# C++ class libraries for building network and internet-based applications
brew "poco"
# Cross-platform library for real-time MIDI I/O
brew "portmidi"
# Theme for zsh
brew "powerlevel10k"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Qt Widgets for Technical Applications
brew "qwt-qt5"
# Safe, concurrent, practical language
brew "rust"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# SOund eXchange: universal sound sample translator
brew "sox"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc", link: false
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Command-line time tracking application
brew "timewarrior"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Manage your kubero applications with the CLI
brew "kubero-dev/kubero/kubero-cli"
# XML parser
brew "osrf/simulation/tinyxml1"
# A CLI tool to interact with Passbolt, a Open source Password Manager for Teams
brew "passbolt/tap/go-passbolt-cli"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Supabase CLI
brew "supabase/tap/supabase"
# TinyGo is a Go compiler for small places. Microcontrollers, WebAssembly, and command-line tools. Based on LLVM.
brew "tinygo-org/tools/tinygo"
# Screenshot software with built-in annotation tools
cask "flameshot"
cask "font-fira-code"
# LilyPond editor
cask "frescobaldi"
# Free and open-source image editor
cask "gimp"
# Vector graphics editor
cask "inkscape"
# Backup/restore tool
cask "kopiaui"
# Programmable solid 3D CAD modeller
cask "openscad"
# Ground control station for drones
cask "qgroundcontrol"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Rust-based terminal
cask "warp"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "activitywatch.aw-watcher-vscode"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "anweber.timewarrior"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "chrisjsewell.myst-tml-syntax"
vscode "d-biehl.robotcode"
vscode "datadog.datadog-vscode"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "fallenmax.mithril-emmet"
vscode "formulahendry.auto-close-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "jeandeaual.lilypond-syntax"
vscode "jeandeaual.scheme"
vscode "korekontrol.saltstack"
vscode "lextudio.iis"
vscode "lextudio.restructuredtext"
vscode "lextudio.restructuredtext-pack"
vscode "lhl2617.lilypond-pdf-preview"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rickaym.manim-sideview"
vscode "sianglim.slim"
vscode "swyddfa.esbonio"
vscode "tamasfe.even-better-toml"
vscode "vivaxy.vscode-conventional-commits"
vscode "windmill-labs.windmill"
go "github.com/go-delve/delve/cmd/dlv"
go "fyne.io/fyne/v2/cmd/fyne"
go "golang.org/x/tools/gopls"
go "github.com/apricote/hcloud-upload-image"
go "honnef.co/go/tools/cmd/staticcheck"
